let questions = [
	{	id: 1,
		text: 'Сколько всего человек сдерживало натиск врага при обороне Брестской крепости?',
		right: 1,
		variants: [
			'3400 человек',
			'3500 человек',
			'3600 человек',
		],
		stro: 'Брест.html',
	},
{		id: 2,
		text: 'Дата освобождение Брестской крепости советскими войсками.',
		right: 2,
		variants: [
			'28 июня 1942',
			'28 июля 1943',
			'28 июля 1944',
		],
		stro: 'Брест.html',
	},
{		id: 3,
		text: 'Кто из художников написал картину «Защитники Брестской крепости»?',
		right: 0,
		variants: [
			'Кривоногов',
			'Симонов',
			'Никто из вышеперечисленных',
		],
		stro: 'Брест.html',
	},
{		id: 4,
		text: 'Дата, когда Киевские аэродромы подверглись налетам авиации противника.',
		right: 0,
		variants: [
			'22 июня 1942 года',
			'12 июня 1941 года',
			'25 июля 1941 года',
		],
		stro: 'Киев.html',
	},
	{		id: 5,
		text: 'Частью чего были Киевский укрепленный район и Коростеньский в Припятской области?',
		right: 0,
		variants: [
			'частью «линии Сталина»',
			'частью Юго-Западного фронта',
			'частью воздушно-десантные корпуса',
		],
		stro: 'Киев.html',
	},
	{		id: 6,
		text: 'Когда была прорвана укрепленная полоса у Киева?',
		right: 1,
		variants: [
			'2 августа',
			'6 августа',
			'12 августа',
		
		],
		stro: 'Киев.html',
	},
	{		id: 7,
		text: 'Когда начаись первые бои за Тулу?',
		right: 0,
		variants: [
			'Октябрь 1941',
			'Сентябрь 1941',
			'Декабрь 1942',
		
		],
		stro: 'Тула.html',
	},
	
	{		id: 8,
		text: 'Какая армия участвовала в обороне Тулы?',
		right: 2,
		variants: [
			'52-я',
			'51-я',
			'50-я',
		
		],
		stro: 'Тула.html',
	},

	{		id: 9,
		text: 'Что делали жители Тулы во время войны?',
		right: 0,
		variants: [
			'Рыли окопы и противотанковые рвы, сооружали баррикады, устанавливали противотанковые ежи и надолбы',
			'Изготавливали оружие, патроны, помогали военным, добывали провинант.',
			'Ничего.',
		
		],
		stro: 'Тула.html',
	},

	{		id: 10,
		text: 'Когда началась блокада Ленинграда?',
		right: 1,
		variants: [
			'7 декабря 1942',
			'8 сентября 1941',
			'6 октября 1941',
		
		],
		stro: 'Ленинград.html',
	},

	{		id: 11,
		text: 'В каком году Ленинград получил звание "Город-герой"?',
		right: 0,
		variants: [
			'1965',
			'1971',
			'1961',
		
		],
		stro: 'Ленинград.html',
	},

	{		id: 12,
		text: 'Сколько грамм хлеба мог получить рабочий в ноябре-декабре 1941?',
		right: 1,
		variants: [
			'200 грамм',
			'250 грамм',
			'300 грамм',
		
		],
		stro: 'Ленинград.html',
	},

	{		id: 13,
		text: 'Что произошло в Волгограде в 1943 году?',
		right: 0,
		variants: [
			'Был установлена  статуя танк Т-34',
			'Жители города отбили атаку немцев.',
			'Поставка вооружения в город.',
		
		],
		stro: 'Волгоград.html',
	},

	{		id: 14,
		text: 'Сколько башен на постаментах танков Т-34, установленных с 1948 по 1954 годы в Волгограде?',
		right: 0,
		variants: [
			'17',
			'18',
			'20',
		
		],
		stro: 'Волгоград.html',
	},

	{		id: 15,
		text: 'Когда был издан приказ об возобновлении работы трамвайного парка в Волгограде?',
		right: 0,
		variants: [
			'28 января 1943',
			'26 января 1943',
			'30 декабря 1942',
		
		],
		stro: 'Волгоград.html',
	},

	{		id: 16,
		text: 'Когда начался первый штурм Севастополя?',
		right: 2,
		variants: [
			'11 декабря',
			'11 сентября',
			'11 ноября',
		
		],
		stro: 'Севастополь.html',
	},

	{		id: 17,
		text: 'Кто стал командиром армии Севастополя с 19 ноября?',
		right: 1,
		variants: [
			'Генерал-майор Иван Петров',
			'Вице-адмирал Филипп Октябрьский',
			'Генерал Владислав Стевастопольский',
		
		],
		stro: 'Севастополь.html',
	},

	{		id: 18,
		text: 'Сколько дней советская армия отражала непрерывные атаки численно превосходящих немецко-фашистских войск в Севастополе?',
		right: 2,
		variants: [
			'7',
			'5',
			'4',
		
		],
		stro: 'Севастополь.html',
	},

	{		id: 19,
		text: 'Когда началась героическая оборона Одессы?',
		right: 0,
		variants: [
			'5 августа 1941',
			'12 августа 1941',
			'29 июля 1941',
		
		],
		stro: 'Одесса.html',
	},

	{		id: 20,
		text: 'Кто был политруком Одесской военно-морской базы?',
		right: 2,
		variants: [
			'Александр Алексеевич Нечипуренко',
			'Никита Иванович Октябрьский',
			'Лев Умерович Краснов',
		
		],
		stro: 'Одесса.html',
	},

	{		id: 21,
		text: 'Где похоронили Нечипуренко в Одессе?',
		right: 0,
		variants: [
			'Аллея славы',
			'проспект Ленина',
			'Курган славы',
		
		],
		stro: 'Одесса.html',
	},

	{		id: 22,
		text: 'Сколько жителей Москвы ушли на фронт в первые дни войны?',
		right: 0,
		variants: [
			'350 тысяч',
			'500 тысяч',
			'700 тысяч',
		
		],
		stro: 'Москва.html',
	},

	{		id: 23,
		text: 'Сколько километров противотанковых рвов возвели на ближних подступах к Москве?',
		right: 1,
		variants: [
			'1400 тысяч',
			'676 тысяч',
			'410 тысяч',
		
		],
		stro: 'Москва.html',
	},

	{		id: 24,
		text: 'Когда состоялся последний салют в Москве?',
		right: 2,
		variants: [
			'10 мая 1945 года',
			'8 мая 1944 года',
			'9 мая 1945 года',
		
		],
		stro: 'Москва.html',
	},

	{		id: 25,
		text: 'Сколько жителей удалось вывезти из Керчи во время налётов немецко-фашистской авиации?',
		right: 1,
		variants: [
			'21 тыс. жителей.',
			'30 тыс. жителей.',
			'47 тыс. жителей.',
		
		],
		stro: 'Керчь.html',
	},

	{		id: 26,
		text: 'Когда был образован Керченский оборонительный район?',
		right: 0,
		variants: [
			'4 ноября',
			'15 октября',
			'4 сентября',
		
		],
		stro: 'Керчь.html',
	},

	{		id: 27,
		text: 'В ходе какой операции Керчь был освобождён в первый раз?',
		right: 2,
		variants: [
			'Вызволенческая операция',
			'Крымской операции',
			'Керченско-Феодосийской десантной операции',
		
		],
		stro: 'Керчь.html',
	},

	{		id: 28,
		text: 'В каком районе 4 февраля в Новороссийске высадился морской десант?',
		right: 0,
		variants: [
			'В районе населенного пункта Станички',
			'Район Починки',
			'В районе Таманского полуострова',
		
		],
		stro: 'Новороссийск.html',
	},

	{		id: 29,
		text: 'Сколько дней советские солдаты держали оборону в Севастополе?',
		right: 2,
		variants: [
			'235 дней',
			'199 дней',
			'225 дней',
		
		],
		stro: 'Новороссийск.html',
	},

	{		id: 30,
		text: 'Кто возглавлял морской десант, который высадился 4 февраля в Новороссийске?',
		right: 0,
		variants: [
			'Цезарь Кунников',
			'Иван Молодеев',
			'Андрей Мечеславов',
		
		],
		stro: 'Новороссийск.html',
	},

	{		id: 31,
		text: 'Год начала Минской операции.',
		right: 1,
		variants: [
			'29 июня 1943',
			'29 июня 1944',
			'29 июля 1944',
		
		],
		stro: 'Минск.html',
	},

	{		id: 32,
		text: 'Сколько делегатов вошли во Второй Всебелорусский конгресс',
		right: 0,
		variants: [
			'1023 делегата',
			'991 делегат',
			'1047 делегатов',
		
		],
		stro: 'Минск.html',
	},

	{		id: 33,
		text: 'С чьей помощью Минское подполье было реабилитировано от подозрений в связях с Гестапо в 1959 году?',
		right: 1,
		variants: [
			'Силами Беларусских партизан',
			'Силами бывших подпольщиков',
			'Силами красной армии',
		
		],
		stro: 'Минск.html',
	},

	{		id: 34,
		text: 'Когда началось вражеское вторжение на Мурманск?',
		right: 2,
		variants: [
			'29 августа 1941 года',
			'29 июля 1941 года',
			'29 июня 1941 года',
		
		],
		stro: 'Мурманск.html',
	},

	{		id: 35,
		text: 'Что произошло в Мурманске 7 октября 1944 года?',
		right: 0,
		variants: [
			'Советские войска Карельского фронта и Северного флота при поддержке авиации начали Петсамо-Киркенесскую наступательную операцию.',
			'Немецкие войска совершили вторую попытку прорваться к Мурманску, но вновь потерпели неудачу и были отброшены за реку Большая Западная Лица.',
			'Самая тяжёлая бомбардировка',
		
		],
		stro: 'Мурманск.html',
	},


	{		id: 36,
		text: 'Сколько зданий сохранилось к концу Великой Отечественной войны в Мурманске?',
		right: 1,
		variants: [
			'Три',
			'Четыре',
			'Пять',
		
		],
		stro: 'Мурманск.html',
	},

	{		id: 37,
		text: 'Дата Смоленского сражения?',
		right: 1,
		variants: [
			'с 10 июня по 10 сентября 1941 года',
			'с 10 июля по 10 сентября 1941 года',
			'с 10 сентября по 10 ноября 1941 года',
		
		],
		stro: 'Смоленск.html',
	},

	{		id: 38,
		text: 'На сколько этапов делится Смоленское сражение?',
		right: 1,
		variants: [
			'2',
			'4',
			'3',
		
		],
		stro: 'Смоленск.html',
	},
	
	{		id: 39,
		text: 'От и до какого числа длился второй этап Смоленского сражения?',
		right: 0,
		variants: [
			'21 июля - 7 августа',
			'14 сентября - 13 августа',
			'7 июня - 21 августа',
		
		],
		stro: 'Смоленск.html',
	},


];

function prov1()
{
var textToFind = localStorage.getItem("key");
if(textToFind == 1)
{
document.getElementById('proddd2').value = "Начать заного";

}
else
{
let x = document.getElementById('proddd');
x.style.display = "none";

}
}


function prov2()
{
localStorage.setItem("key2","1");
}
function prov3()
{
localStorage.removeItem("arrs");
localStorage.removeItem("vopps");
localStorage.removeItem("nows");
localStorage.removeItem("counts");
localStorage.removeItem("key2");
localStorage.removeItem("key");
localStorage.removeItem("rezults");

}
